Test/Jerome_Test/Framework/IIS/xml/01-1_arr_cancelRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:it="http://www.tmforum.org/mtop/fmw/xsd/mepit/v1" xmlns:wsa="http://www.w3.org/2005/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/mtop/fmw/xsd/mepit/v1 ../xsd/MepIteratorDefinitionsV1-0.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/iterator/sp</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/it/v1-0/cancelRequest</wsa:Action>
    <wsa:ReplyTo>
      <wsa:Address>http://host:port/iterator/sc</wsa:Address>
    </wsa:ReplyTo>
    <wsa:MessageID>http://host:port/iterator/1234</wsa:MessageID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <it:cancelRequest>
      <it:iteratorId>123456</it:iteratorId>
    </it:cancelRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
